Config/Reports/ПроверкаКонтрольныхСоотношенийГУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПроверкаКонтрольныхСоотношенийГУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПостроительЗапроса</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВсеСоотношения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Documents/УниверсальныйРегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УниверсальныйРегламентированныйОтчет</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Периоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньТочности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийРедактировавший</Name>
					<Comment>Пользователь, внесший последние изменения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РедакцииОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БланкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеАналитики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПечатныйБланк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизвольныеБланкиФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатЗаполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Reports/ПроверкаКонтрольныхСоотношенийГУ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем мФабрикаXDTO;

Перем мСписокПроверяемыхДокументов;

Перем мКэшДанныхОтобранныхОтчетов; // Переменная хранит данные проверяемых отчетов

// Устанавливает список проверяемых отчетов
//
Процедура УстановитьСписокОтчетов(СписокОтчетов) Экспорт
	
	Если ТипЗнч(СписокОтчетов) = Тип("СписокЗначений") Тогда
		мСписокПроверяемыхДокументов = СписокОтчетов;
	ИначеЕсли ТипЗнч(СписокОтчетов) = Тип("Массив") Тогда
		мСписокПроверяемыхДокументов = Новый СписокЗначений;
		мСписокПроверяемыхДокументов.ЗагрузитьЗначения(СписокОтчетов);
	КонецЕсли;
	
КонецПроцедуры // УстановитьСписокОтчетов()

// Выполняет группировку протоколов из кэша.
//
Функция СгруппироватьПротоколыПоЗаданнымПолям(Знач ПоляГруппировки, ТаблицаПротоколов = Неопределено, ТипПреобразованияИзXDTO = Неопределено) Экспорт

	ГруппировочныйКэш = Новый ТаблицаЗначений;
	
	Если ТипЗнч(ПоляГруппировки) = Тип("Строка") Тогда
		ПоляГруппировки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоляГруппировки);
	КонецЕсли;
	
	Для Каждого Поле Из ПоляГруппировки Цикл
		ГруппировочныйКэш.Колонки.Добавить(Поле);
		ГруппировочныйКэш.Индексы.Добавить(Поле);
	КонецЦикла;
	
	Если ТаблицаПротоколов = Неопределено Тогда
		ТаблицаПротоколов = мКэшДанныхОтобранныхОтчетов;
	КонецЕсли;
	
	ГруппировочныйКэш.Колонки.Добавить("ПротоколПроверки");
	
	Для Каждого ОтчетИсточник Из ТаблицаПротоколов Цикл
		
		Если ОтчетИсточник.ПротоколПроверки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		Для Каждого Поле Из ПоляГруппировки Цикл
			СтруктураПоиска.Вставить(Поле,ОтчетИсточник[Поле]);
		КонецЦикла;
		
		// Получим результирующий документ
		Протоколы = ГруппировочныйКэш.НайтиСтроки(СтруктураПоиска);
		
		Если Протоколы.Количество() = 0 Тогда
			// Результирующий документ еще не сформирован
			СтрПротокол = ГруппировочныйКэш.Добавить();
			ЗаполнитьЗначенияСвойств(СтрПротокол,ОтчетИсточник);
			
			Протокол = Неопределено;
		Иначе
			Протокол = Протоколы[0].ПротоколПроверки;
		КонецЕсли;
		 
		Если Протокол = Неопределено Тогда
			Протокол 					 = Новый ТабличныйДокумент;
			СтрПротокол.ПротоколПроверки = Протокол;
		КонецЕсли;
			
		Протокол.Вывести(ОтчетИсточник.ПротоколПроверки);
		
	КонецЦикла;
	
	Возврат ГруппировочныйКэш;

КонецФункции // СгруппироватьПротоколыПоЗаданнымПолям()

// Возвращает таблицу, которую можно использовать для группировки протоколов
//
Функция ПолучитьТаблицуГруппировкиПротоколов() Экспорт
	
	ТаблицаКэша = Новый ТаблицаЗначений;
	
	ТаблицаКэша.Колонки.Добавить("Ссылка");
	ТаблицаКэша.Колонки.Добавить("Организация");
	ТаблицаКэша.Колонки.Добавить("ВидОтчета");
	ТаблицаКэша.Колонки.Добавить("ОписаниеАналитики");
	ТаблицаКэша.Колонки.Добавить("ОтчетныйПериод");
	ТаблицаКэша.Колонки.Добавить("ИФО");
	ТаблицаКэша.Колонки.Добавить("ПротоколПроверки");
	ТаблицаКэша.Колонки.Добавить("ОбщийРезультатПроверки");
	ТаблицаКэша.Колонки.Добавить("ВсегоОшибок");
	ТаблицаКэша.Колонки.Добавить("ВсегоПредупреждений");
	
	Возврат ТаблицаКэша;
	
КонецФункции // ПолучитьТаблицуГруппировкиПротоколов()

// Функция определяет работает ли отчет в режиме внешнего вызова
//
Функция ИспользоватьВнешнийСписокОтчетов() Экспорт
	
	Возврат Не (мСписокПроверяемыхДокументов = Неопределено);
	
КонецФункции // ИспользоватьВнешнийСписокОтчетов()


///////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПРОТОКОЛОВ ПРОВЕРКИ
//

// Вспомогательная процедура вывода табличного протокола.
//
Процедура ВывестиОбластьРеквизита(ИмяРеквизита,ЗначениеРеквизита,ОбластьРеквизита,ТабДокумент)
	
	ОбластьРеквизита.Параметры.ИмяРеквизита=ИмяРеквизита+": ";
	ОбластьРеквизита.Параметры.ЗначениеРеквизита=ЗначениеРеквизита;
	
	ТабДокумент.Вывести(ОбластьРеквизита);
	
КонецПроцедуры // ВывестиОбластьРеквизита()

Функция ПолучитьОписаниеФормулы(ОтчетОбъект, СтрСоотношение, Часть, СтруктураОперандов, ФорматЗначения, ТолькоОшибочные)
	
	ТекстСоотношения = СтрСоотношение["Выражение" + Часть];
	
	ЕстьАналитика = Ложь;
	Для Каждого КолонкаРасчета Из СтрСоотношение.ДанныеРасчета.Колонки Цикл
		Если Лев(КолонкаРасчета.Имя,9) = "Аналитика" Тогда
			ЕстьАналитика = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрДанные ИЗ СтрСоотношение["СписокИспользуемых"+Часть] Цикл
		
		КодОперанда = СтрДанные.Значение;
		
		ТекстЗначениеОперанда = "";
		Если СтрСоотношение.ДанныеРасчета <> Неопределено Тогда
			ЗначениеОперанда = 0;
			
			Если ЕстьАналитика = Ложь Тогда
				Отбор = Новый Структура();
				Отбор.Вставить("ИтогПоПоказателю",Истина);
				ДанныеРасчетаДляФормулы = СтрСоотношение.ДанныеРасчета.НайтиСтроки(Отбор);
				
				Для Каждого СтрокаДанныхДляФормулы Из ДанныеРасчетаДляФормулы Цикл
					ЗначениеОперанда = ЗначениеОперанда + СтрокаДанныхДляФормулы["_"+КодОперанда];
				КонецЦикла;	
			Иначе
				Для Каждого СтрокаДанныхДляФормулы Из СтрСоотношение.ДанныеРасчета Цикл
					Если СтрокаДанныхДляФормулы.РезультатРасчета И ТолькоОшибочные Тогда
						Продолжить;
					КонецЕсли;
					
					Если СтрокаДанныхДляФормулы.ИтогПоПоказателю Тогда
						Продолжить;
					КонецЕсли;
					ЗначениеОперанда = ЗначениеОперанда + СтрокаДанныхДляФормулы["_"+КодОперанда];
				КонецЦикла;
			КонецЕсли;	
			
			ТекстЗначениеОперанда = " ("+Формат(ЗначениеОперанда,ФорматЗначения+";ЧН=0")+")";
		КонецЕсли;	
		
		СтрОперанд = Неопределено;
		СтруктураОперандов.Свойство(КодОперанда,СтрОперанд);
		
		Если Не СтрОперанд = Неопределено Тогда
			ТекстСоотношения = СтрЗаменить(ТекстСоотношения,"["+КодОперанда+"]","["+СтрОперанд.Наименование+"]"+ТекстЗначениеОперанда+Символы.НПП);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СокрЛП(ТекстСоотношения);
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ ПОЛУЧЕНИЯ ПРОТОКОЛОВ РАЗЛИЧНЫХ ФОРМАТОВ
//

Функция ДобавитьРасшифровкуУправляемыйРежим(ДанныеРасшифровки, Значение, Счетчик)

	ЗначениеРасшифровки = Счетчик;
	
	ДанныеРасшифровки.Вставить(Счетчик,Значение);
	Счетчик = Счетчик + 1;
	
	Возврат ЗначениеРасшифровки;

КонецФункции


// Формирует стандартный протокол проверки в фиде табличного документа.
//
// Параметры
//  ОтчетОбъект  - проверенный объект отчета
//
//	ТолькоОшибочные - режим вывода только соотношений с ошибками
//
// Возвращаемое значение:
//   ТабличныйДокумент - протокол проверки
//
Функция ПолучитьТабличныйДокументПротоколаПроверки(ОтчетОбъект, ТолькоОшибочные = Истина, СчетчикРасшифровок = 0, ДанныеРасшифровки = Неопределено) Экспорт
	
	Макет = ПолучитьМакет("МакетКонтрольныеСоотношения");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Очистить();
	
	ОбластьШапкаОтчета		= Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьШапкаРазделитель	= Макет.ПолучитьОбласть("ШапкаРазделитель");
	ОбластьШапкаНижняяГраница= Макет.ПолучитьОбласть("ШапкаНижняяГраница");
	ОбластьШапкаКС			= Макет.ПолучитьОбласть("ШапкаСоотношения");
	ОбластьСравнениеИтогов	= Макет.ПолучитьОбласть("СравнениеИтогов");
	ОбластьШапкаРасшифровка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьРеквизиты		= Макет.ПолучитьОбласть("ОбластьРеквизиты");
	ОбластьСтрокаТаблицы	= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьФормула			= Макет.ПолучитьОбласть("Формула");
	ОбластьОписание			= Макет.ПолучитьОбласть("ОписаниеСоотношения");
	ОбластьПредупреждение	= Макет.ПолучитьОбласть("ТекстПредупреждения");
	ОбластьСравнениеСтроки	= Макет.ПолучитьОбласть("СравнениеСтроки");
	ОбластьСравнениеСтрокиГ	= Макет.ПолучитьОбласть("СравнениеСтрокиГруппировка");
	ОбластьОписанияСтроки	= Макет.ПолучитьОбласть("ОписаниеСтроки");
	ОбластьПодвал			= Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	ЦветОК 		= WebЦвета.ТемноЗеленый;
	ЦветОшибки  = WebЦвета.Красный;
	ЦветПредупреждения  = WebЦвета.Синий;
	ЦветНеактивности = WebЦвета.СеребристоСерый;
	
	ЦветОшибкаРасчета 		= WebЦвета.Черный;
	ЦветФонаОшибкиРасчета	= WebЦвета.СеребристоСерый;
	
	ЦветФонаОК = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаОшибки = WebЦвета.ТусклоРозовый;
	ЦветФонаПредупреждения =  WebЦвета.АкварельноСиний;
	
	РезультатПроверки = Истина;
	
	КоличественныеПараметры = Новый Структура;
	КоличественныеПараметры.Вставить("КоличествоОшибок",0);
	КоличественныеПараметры.Вставить("КоличествоПредупреждений",0);
	КоличественныеПараметры.Вставить("КоличествоОшибокРасчета",0);
	
	ФорматЗначения = "ЧН=0; ЧДЦ=" + Строка(ОтчетОбъект.УровеньТочности);
	
	// Установка форматов значения
	
	ОбластьСравнениеИтогов.Области.Расхождение.Формат = ФорматЗначения;
	ОбластьСравнениеИтогов.Области.ЗначениеЛев.Формат = ФорматЗначения;
	ОбластьСравнениеИтогов.Области.ЗначениеПрав.Формат = ФорматЗначения;
	
	ОбластьСравнениеСтроки.Области.ЗначениеЛевСтроки.Формат = ФорматЗначения;
	ОбластьСравнениеСтроки.Области.ЗначениеПравСтроки.Формат = ФорматЗначения;
	ОбластьСравнениеСтроки.Области.РасхождениеСтроки.Формат = ФорматЗначения;
	
	ОбластьСравнениеСтрокиГ.Области.ЗначениеЛевСтрокиГ.Формат = ФорматЗначения;
	ОбластьСравнениеСтрокиГ.Области.ЗначениеПравСтрокиГ.Формат = ФорматЗначения;
	ОбластьСравнениеСтрокиГ.Области.РасхождениеСтрокиГ.Формат = ФорматЗначения;
	
	ОбластьСтрокаТаблицы.Области.ЗначениеЛевТабл.Формат = ФорматЗначения;
	ОбластьСтрокаТаблицы.Области.ЗначениеПравТабл.Формат = ФорматЗначения;
	
	Если ДанныеРасшифровки = Неопределено Тогда
		ДанныеРасшифровки  = Новый Соответствие;
	КонецЕсли;
	
	//Вывод проверки контрольных соотношений ФЛК
	Если ОтчетОбъект.мКонтрольныеСоотношенияФЛК.Количество() Тогда
		
		ВыводОбластиФЛК(Макет, ОтчетОбъект, ТабДокумент, ТолькоОшибочные, СчетчикРасшифровок, ДанныеРасшифровки, РезультатПроверки, КоличественныеПараметры);
		
	КонецЕсли;
	
	//Вывод проверки контрольных соотношений ФЛК
	Если ОтчетОбъект.мКонтрольныеСоотношенияБК.Количество() Тогда
		
		ВыводОбластиКонтрольБК(Макет, ОтчетОбъект, ТабДокумент, ТолькоОшибочные, СчетчикРасшифровок, ДанныеРасшифровки, РезультатПроверки, КоличественныеПараметры);
		
	КонецЕсли;
	
	ДанныеВидовАналитики = ПланыВидовХарактеристик.АналитикаОтчетов.ПолучитьДанныеВидовАналитики();
	
	ПараметрыОтбора = Новый Структура;
	Если ТолькоОшибочные Тогда
		МассивСтрокТаблицыКС = Новый Массив;
		
		Для Каждого СтрТЧ Из ОтчетОбъект.мКонтрольныеСоотношения Цикл
			Если СтрТЧ.РезультатРасчета = Ложь
				ИЛИ СтрТЧ.РасчетВыполнен = Ложь Тогда
				МассивСтрокТаблицыКС.Добавить(СтрТЧ);
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаКонтрольныеСоотношения = ОтчетОбъект.мКонтрольныеСоотношения.Скопировать(МассивСтрокТаблицыКС);
	Иначе
		ТаблицаКонтрольныеСоотношения = ОтчетОбъект.мКонтрольныеСоотношения;
	КонецЕсли;
	
	ТаблицаКонтрольныеСоотношения.Сортировать("НомерСоотношения, КонтрольноеСоотношение");
	
	Для Каждого СтрСоотношение ИЗ ТаблицаКонтрольныеСоотношения Цикл
		
		Если ТолькоОшибочные 
			И СтрСоотношение.РезультатРасчета
			И СтрСоотношение.РасчетВыполнен Тогда
			Продолжить;
		КонецЕсли;
		
		// Вывод шапки
		
		ОбластьШапкаКС.Параметры.КонтрольноеСоотношение = СтрСоотношение.КонтрольноеСоотношение;
		ОбластьШапкаКС.Области.КС.Расшифровка = СтрСоотношение.КонтрольноеСоотношение;
				
		ВыводитьОтклонения = Ложь;
		
		Если СтрСоотношение.ДанныеРасчета<> Неопределено Тогда
			
			Если СтрСоотношение.РасчетВыполнен = Ложь Тогда
				КоличественныеПараметры.Вставить("КоличествоОшибокРасчета", КоличественныеПараметры.КоличествоОшибокРасчета+1);
				
				ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "Ошибка расчета";
				ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветОшибкаРасчета;
				
				ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаОшибкиРасчета;
				ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаОшибкиРасчета;
			
			ИначеЕсли Не СтрСоотношение.РезультатРасчета И СтрСоотношение.Дополнительное <> Истина Тогда
				КоличественныеПараметры.Вставить("КоличествоОшибок", КоличественныеПараметры.КоличествоОшибок+1);
				
				РезультатПроверки = Ложь;
				ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "Ошибка";
				ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветОшибки;
				ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаОшибки;
				ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаОшибки;
				
				ОбластьСравнениеИтогов.Параметры.Расхождение = СтрСоотношение.ЗначениеЛев-СтрСоотношение.ЗначениеПрав;
				ОбластьСравнениеИтогов.Параметры.ТекстОтклонение = "Отклонение:";
				ОбластьСравнениеИтогов.Области.Расхождение.ЦветТекста = ЦветОшибки;
				
			ИначеЕсли Не СтрСоотношение.РезультатРасчета И СтрСоотношение.Дополнительное = Истина Тогда
				КоличественныеПараметры.Вставить("КоличествоПредупреждений", КоличественныеПараметры.КоличествоПредупреждений+1);
				
				ЕстьПредупреждения = Истина;
				ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "Предупреждение";
				ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветПредупреждения;
				ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаПредупреждения;
				ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаПредупреждения;
				
				ОбластьСравнениеИтогов.Параметры.Расхождение = СтрСоотношение.ЗначениеЛев-СтрСоотношение.ЗначениеПрав;
				ОбластьСравнениеИтогов.Параметры.ТекстОтклонение = "Отклонение:";
				ОбластьСравнениеИтогов.Области.Расхождение.ЦветТекста = ЦветПредупреждения;
				
			ИначеЕсли СтрСоотношение.Использование = 2 Тогда
				ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "Отключено";
				ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = WebЦвета.Черный;
				ОбластьШапкаКС.Области.ОбластьЗаголовка.ЦветФона   = ЦветНеактивности;
				
				ОбластьСравнениеИтогов.Параметры.Расхождение = Неопределено;
				ОбластьСравнениеИтогов.Параметры.ТекстОтклонение = "";
				ОбластьСравнениеИтогов.Области.Расхождение.ЦветТекста = ЦветОК;
				
			Иначе
				ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "ОК";
				ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветОК;
				
				ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаОК;
				ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаОК;
				
				ОбластьСравнениеИтогов.Параметры.Расхождение = Неопределено;
				ОбластьСравнениеИтогов.Параметры.ТекстОтклонение = "";
				ОбластьСравнениеИтогов.Области.Расхождение.ЦветТекста = ЦветОК;
			КонецЕсли; 
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьШапкаРазделитель);
		ТабДокумент.Вывести(ОбластьШапкаКС);
		
		//Группировка внутри одного соотношения:
		ТабДокумент.НачатьГруппуСтрок(,ТолькоОшибочные);
		
		// Вывод описания.
		Если Не ПустаяСтрока(СтрСоотношение.Описание) Тогда
			ОбластьОписание.Параметры.ОписаниеКонтрольногоСоотношения = СтрСоотношение.Описание;
			ТабДокумент.Вывести(ОбластьОписание);
		КонецЕсли;
		
		Если СтрСоотношение.РасчетВыполнен = Ложь Тогда //вывод текста ошибки расчета КС - ошибка в формуле или настройке КС
			ОбластьПредупреждение.Параметры.ТекстПредупрежденияКонтрольногоСоотношения = СтрСоотношение.ТекстОшибкиРасчета;
			ТабДокумент.Вывести(ОбластьПредупреждение);
			Продолжить;
		КонецЕсли;
		
		Если СтрСоотношение.Дополнительное = Истина
			И СтрСоотношение.РезультатРасчета = Ложь 
			И ЗначениеЗаполнено(СтрСоотношение.ТекстПояснения) Тогда
			
			ОбластьПредупреждение.Параметры.ТекстПредупрежденияКонтрольногоСоотношения = СтрСоотношение.ТекстПояснения;
			ТабДокумент.Вывести(ОбластьПредупреждение);
		КонецЕсли;
		
		Аналитики = Новый СписокЗначений;
		
		Если СтрСоотношение.ДанныеРасчета<>Неопределено Тогда
			Для Каждого КолонкаРасчета Из СтрСоотношение.ДанныеРасчета.Колонки Цикл
				Если Лев(КолонкаРасчета.Имя,9) = "Аналитика" Тогда
					Аналитики.Добавить(КолонкаРасчета.Имя,КолонкаРасчета.Заголовок);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ЧислоАналитик = Аналитики.Количество();
		
		// Вывод итогов по контрольному соотношению.
		// Если в КС для операндов задана детализация по аналитике, то в качестве итоговых значений КС будут выведены значения - итог детальных строк по аналитике.
		Если СтрСоотношение.ДанныеРасчета<>Неопределено
			И ЧислоАналитик>0 Тогда
			ТекЛев = 0;
			ТекПрав = 0;
			ТекОткл = 0;
			Для Каждого СтрДанныхРасчета Из СтрСоотношение.ДанныеРасчета Цикл
				
				Если СтрДанныхРасчета.РезультатРасчета И ТолькоОшибочные Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрДанныхРасчета.ИтогПоПоказателю Тогда
					Продолжить;
				КонецЕсли;
				
				ТекЛев = ТекЛев + СтрДанныхРасчета.ЗначениеЛев;
				ТекПрав = ТекПрав + СтрДанныхРасчета.ЗначениеПрав;
				Если НЕ СтрДанныхРасчета.РезультатРасчета Тогда
					ТекОткл = ТекОткл + СтрДанныхРасчета.ЗначениеЛев - СтрДанныхРасчета.ЗначениеПрав;
				КонецЕсли;
			КонецЦикла;
			
			ОбластьСравнениеИтогов.Параметры.ЗначениеЛев  = ТекЛев;
			ОбластьСравнениеИтогов.Параметры.ЗначениеПрав = ТекПрав;
			ОбластьСравнениеИтогов.Параметры.Расхождение = ТекОткл;
			ОбластьСравнениеИтогов.Параметры.Условие	  = СтрСоотношение.Условие;
			
		Иначе
			//Если детализации нет, будет вывод итогового значения операндов.
			ОбластьСравнениеИтогов.Параметры.ЗначениеЛев  = ?(СтрСоотношение.ЗначениеЛев = Неопределено, 0, СтрСоотношение.ЗначениеЛев);
			ОбластьСравнениеИтогов.Параметры.ЗначениеПрав = ?(СтрСоотношение.ЗначениеПрав= Неопределено, 0, СтрСоотношение.ЗначениеПрав);
			ОбластьСравнениеИтогов.Параметры.Условие	  = СтрСоотношение.Условие;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСравнениеИтогов);
		
		// Структура описаний операндов для упрощения доступа к ним.
		СтруктураОперандовСоотношения = Новый Структура;
		МассивОперандов = ОтчетОбъект.мОперандыКонтр.НайтиСтроки(Новый Структура("КонтрольноеСоотношение",СтрСоотношение.КонтрольноеСоотношение));
		Для Каждого СтрОперанд Из МассивОперандов Цикл
			СтруктураОперандовСоотношения.Вставить(СтрОперанд.Код,СтрОперанд);
		КонецЦикла;
		
		// Вывод формул расчета
		ОбластьФормула.Параметры.ВыражениеЛев  = ПолучитьОписаниеФормулы(ОтчетОбъект,СтрСоотношение,"Лев",СтруктураОперандовСоотношения, ФорматЗначения, ТолькоОшибочные);
		ОбластьФормула.Параметры.ВыражениеПрав = ПолучитьОписаниеФормулы(ОтчетОбъект,СтрСоотношение,"Прав",СтруктураОперандовСоотношения, ФорматЗначения, ТолькоОшибочные);
		
		ТабДокумент.Вывести(ОбластьФормула);
		ТабДокумент.Вывести(ОбластьШапкаРасшифровка);
			
		КоличествоАналитик = 0;
		ЭлементыАналитики = Новый Массив;
		Если Аналитики.Количество() Тогда
			 КоличествоАналитик = 1;
			 ЭлементыАналитики = Аналитики.ВыгрузитьЗначения();
		КонецЕсли;
		
		ВысотаДокументаРасшифровки = Макс(КоличествоАналитик,
		СтрСоотношение.СписокИспользуемыхЛев.Количество(),
		СтрСоотношение.СписокИспользуемыхПрав.Количество());
		
		Если СтрСоотношение.ДанныеРасчета<>Неопределено Тогда
			СтрСоотношение.ДанныеРасчета.Сортировать("ИтогПоПоказателю");
			
			Для Каждого СтрДанныхРасчета Из СтрСоотношение.ДанныеРасчета Цикл
				
				Если СтрДанныхРасчета.РезультатРасчета и ТолькоОшибочные Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЧислоАналитик > 0 Тогда
					
					Если СтрДанныхРасчета.ИтогПоПоказателю Тогда
						ОбластьСтроки = ОбластьСравнениеСтроки;
					Иначе
						ОбластьСтроки = ОбластьСравнениеСтрокиГ;
					КонецЕсли;
					
					ОбластьСтроки.Параметры.Заполнить(СтрДанныхРасчета);
					ОбластьСтроки.Параметры.Условие = СтрСоотношение.Условие;
					
					Если СтрДанныхРасчета.ИтогПоПоказателю Тогда
						ОбластьСтроки.Параметры.ТекстИтоговойСтроки = "Итоговое значение";
						// Расчет расхождения по строке.
						Если Не СтрДанныхРасчета.РезультатРасчета Тогда
							ОбластьСтроки.Параметры.Расхождение = СтрДанныхРасчета.ЗначениеЛев - СтрДанныхРасчета.ЗначениеПрав;
							Если СтрСоотношение.Дополнительное <> Истина Тогда
								ОбластьСтроки.Области.РасхождениеСтроки.ЦветТекста = ЦветОшибки;
							Иначе
								ОбластьСтроки.Области.РасхождениеСтроки.ЦветТекста = ЦветПредупреждения;
							КонецЕсли;
						Иначе
							ОбластьСтроки.Параметры.Расхождение = "";
						КонецЕсли;
						
					Иначе
						
						СтрАналитики = "";	
						Для Каждого ЭлементАналитики из ЭлементыАналитики Цикл
							
							Значение = Строка(СтрДанныхРасчета[ЭлементАналитики]);
							
							Если ПустаяСтрока(Значение) Тогда
								Значение = "<...>";
							КонецЕсли;
							
							СтрАналитики = СтрАналитики +  Значение + " ";
						КонецЦикла;
						
						СтрАналитики =СокрП(СтрАналитики);
						ОбластьСтроки.Параметры.КодАналитики = "Аналитика:";
						ОбластьСтроки.Параметры.ЗначениеАналитикиПредставление = СтрАналитики;
						
						// Расчет расхождения по строке.
						Если Не СтрДанныхРасчета.РезультатРасчета Тогда
							ОбластьСтроки.Параметры.Расхождение = СтрДанныхРасчета.ЗначениеЛев - СтрДанныхРасчета.ЗначениеПрав;
							Если СтрСоотношение.Дополнительное <> Истина Тогда
								ОбластьСтроки.Области.РасхождениеСтрокиГ.ЦветТекста = ЦветОшибки;
							Иначе
								ОбластьСтроки.Области.РасхождениеСтрокиГ.ЦветТекста = ЦветПредупреждения;
							КонецЕсли;
						Иначе
							ОбластьСтроки.Параметры.Расхождение = "";
						КонецЕсли;
						
					КонецЕсли;
										
					ТабДокумент.Вывести(ОбластьСтроки);
				КонецЕсли;
				
				СтруктураРасшифровки = Новый Структура;
				СтруктураРасшифровки.Вставить("ДокументСсылка"	,ОтчетОбъект.Ссылка);
				СтруктураРасшифровки.Вставить("ИмяРасшифровки"	,"РасшифровкаОперандаКС");
				СтруктураРасшифровки.Вставить("ЭтоИтог"		  	,СтрДанныхРасчета.ИтогПоПоказателю);
				СтруктураРасшифровки.Вставить("ЭтоПравыйПоказатель",Ложь);
				СтруктураРасшифровки.Вставить("ОтборПоАналитике",Неопределено);
				
				Если ЧислоАналитик > 0 И НЕ СтрДанныхРасчета.ИтогПоПоказателю Тогда 
					ТабДокумент.НачатьГруппуСтрок(,Ложь);
					СтрАналитики = "";
					
					СтруктураРасшифровки.ОтборПоАналитике = Новый Структура;
					
					Для Каждого ЭлементАналитики из Аналитики Цикл
						Представление	= ЭлементАналитики.Представление;
						Значение		= ?(ПустаяСтрока(Строка(СтрДанныхРасчета[ЭлементАналитики.Значение])),"<...>",Строка(СтрДанныхРасчета[ЭлементАналитики.Значение]));
						СтрАналитики = СтрАналитики + ", " + Представление + ": " + Значение;
						СтруктураРасшифровки.ОтборПоАналитике.Вставить(ЭлементАналитики.Значение,СтрДанныхРасчета[ЭлементАналитики.Значение]);
					КонецЦикла;
					СтрАналитики = Сред(СтрАналитики,2);
					ОбластьОписанияСтроки.Параметры.ОписаниеАналитики = СтрАналитики;
					ТабДокумент.Вывести(ОбластьОписанияСтроки);
				КонецЕсли;
				// формирование мини-таблицы расшифровки
				Для Индекс = 1 По ВысотаДокументаРасшифровки Цикл
									
					// Левая часть операндов
					Если Индекс <= СтрСоотношение.СписокИспользуемыхЛев.Количество() Тогда
						
						КодОперанда = СтрСоотношение.СписокИспользуемыхЛев[Индекс-1].Значение;
						
						ОбластьСтрокаТаблицы.Параметры.ЗначениеЛев = СтрДанныхРасчета["_"+КодОперанда];
						
						СтрОперанд = Неопределено;
						Если СтруктураОперандовСоотношения.Свойство(КодОперанда,СтрОперанд) Тогда
						 	ЗначениеРасшифровки = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(СтруктураРасшифровки);
							ЗначениеРасшифровки.Вставить("Операнд",СтрОперанд.Ссылка);
							
							Если СтруктураРасшифровки.ОтборПоАналитике <> Неопределено
								И СтрОперанд.ЕстьВыбраннаяСопоставляемаяАналитика = Истина Тогда
								
								ТекОтборПоАналитике = Новый Структура(Новый ФиксированнаяСтруктура(СтруктураРасшифровки.ОтборПоАналитике));
								Для Каждого СтрДетализации Из СтрОперанд.ПравилаИспользованияПолейЗапроса Цикл
									Если ЗначениеЗаполнено(СтрДетализации.СопоставляемаяАналитика) Тогда
										//если была выбрана группировочная аналитики, то надо для отбора расшифровки вернуть исходную аналитику
										ТекДанныеВидаАналитики = ДанныеВидовАналитики[СтрДетализации.СопоставляемаяАналитика];
										ТекОтборПоАналитике.Вставить(СтрДетализации.КодАналитики,ТекОтборПоАналитике[ТекДанныеВидаАналитики.АналитикаКод]);
										ТекОтборПоАналитике.Удалить(ТекДанныеВидаАналитики.АналитикаКод);
										
									КонецЕсли;
								КонецЦикла;
								ЗначениеРасшифровки.ОтборПоАналитике = ТекОтборПоАналитике;
							КонецЕсли;
							
							ОбластьСтрокаТаблицы.Параметры.РасшифровкаЗначенияЛев = ДобавитьРасшифровкуУправляемыйРежим(ДанныеРасшифровки,ЗначениеРасшифровки,СчетчикРасшифровок);
							ОбластьСтрокаТаблицы.Параметры.НаименованиеОперандЛев = СтрОперанд.Наименование;
						Иначе // Неиспользуемый операнд в формуле
							ОбластьСтрокаТаблицы.Параметры.ОперандЛев 			  = Неопределено;
							ОбластьСтрокаТаблицы.Параметры.НаименованиеОперандЛев = КодОперанда;
							СтрОперанд.ФлагОшибки = Истина;
						КонецЕсли;
						
						Если СтрОперанд.ФлагОшибки Тогда
							ОбластьСтрокаТаблицы.Области.ОперандЛев.ЦветФона = ЦветНеактивности;
						КонецЕсли;
						
					Иначе
						ОбластьСтрокаТаблицы.Параметры.РасшифровкаЗначенияЛев = Неопределено;
						ОбластьСтрокаТаблицы.Параметры.ОперандЛев			  = Неопределено;
						ОбластьСтрокаТаблицы.Параметры.НаименованиеОперандЛев = Неопределено;
						ОбластьСтрокаТаблицы.Параметры.ЗначениеЛев 			  = Неопределено;
					КонецЕсли;
					
					// Правая часть операндов
					Если Индекс <= СтрСоотношение.СписокИспользуемыхПрав.Количество() Тогда
						
						КодОперанда = СтрСоотношение.СписокИспользуемыхПрав[Индекс-1].Значение;
						
						ОбластьСтрокаТаблицы.Параметры.ЗначениеПрав = СтрДанныхРасчета["_"+КодОперанда];
						
						СтрОперанд = Неопределено;
						Если СтруктураОперандовСоотношения.Свойство(КодОперанда,СтрОперанд) Тогда
							ЗначениеРасшифровки = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(СтруктураРасшифровки);
							ЗначениеРасшифровки.Вставить("Операнд",СтрОперанд.Ссылка);
							ЗначениеРасшифровки.Вставить("ЭтоПравыйПоказатель", Истина);
							
							Если СтруктураРасшифровки.ОтборПоАналитике <> Неопределено
								И СтрОперанд.ЕстьВыбраннаяСопоставляемаяАналитика = Истина Тогда
								
								ТекОтборПоАналитике = Новый Структура(Новый ФиксированнаяСтруктура(СтруктураРасшифровки.ОтборПоАналитике));
								Для Каждого СтрДетализации Из СтрОперанд.ПравилаИспользованияПолейЗапроса Цикл
									Если ЗначениеЗаполнено(СтрДетализации.СопоставляемаяАналитика) Тогда
										//если была выбрана группировочная аналитики, то надо для отбора расшифровки вернуть исходную аналитику
										ТекДанныеВидаАналитики = ДанныеВидовАналитики[СтрДетализации.СопоставляемаяАналитика];
										ТекОтборПоАналитике.Вставить(СтрДетализации.КодАналитики,ТекОтборПоАналитике[ТекДанныеВидаАналитики.АналитикаКод]);
										ТекОтборПоАналитике.Удалить(ТекДанныеВидаАналитики.АналитикаКод);
										
									КонецЕсли;
								КонецЦикла;
								ЗначениеРасшифровки.ОтборПоАналитике = ТекОтборПоАналитике;
							КонецЕсли;
							
							ОбластьСтрокаТаблицы.Параметры.РасшифровкаЗначенияПрав = ДобавитьРасшифровкуУправляемыйРежим(ДанныеРасшифровки,ЗначениеРасшифровки,СчетчикРасшифровок);
							ОбластьСтрокаТаблицы.Параметры.НаименованиеОперандПрав = СтрОперанд.Наименование;
						Иначе // Неиспользуемый операнд в формуле
							ОбластьСтрокаТаблицы.Параметры.ОперандПрав 			   = Неопределено;
							ОбластьСтрокаТаблицы.Параметры.НаименованиеОперандПрав = КодОперанда;
							СтрОперанд.ФлагОшибки = Истина;
						КонецЕсли;
						
						Если СтрОперанд.ФлагОшибки Тогда
							ОбластьСтрокаТаблицы.Области.ОперандПрав.ЦветФона = ЦветНеактивности;
						КонецЕсли;
						
					Иначе
						ОбластьСтрокаТаблицы.Параметры.РасшифровкаЗначенияПрав = Неопределено;
						ОбластьСтрокаТаблицы.Параметры.ОперандПрав			   = Неопределено;
						ОбластьСтрокаТаблицы.Параметры.НаименованиеОперандПрав = Неопределено;
						ОбластьСтрокаТаблицы.Параметры.ЗначениеПрав 		   = Неопределено;
					КонецЕсли;
					
					ТабДокумент.Вывести(ОбластьСтрокаТаблицы);
					
				КонецЦикла;
				
				Если ЧислоАналитик > 0 И НЕ СтрДанныхРасчета.ИтогПоПоказателю Тогда 
					ТабДокумент.ЗакончитьГруппуСтрок();
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьПодвал);
		
		ТабДокумент.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
		
	ТекстОтчет = "Отчет № " + ОтчетОбъект.Номер + " от " + Формат(ОтчетОбъект.Дата,"ДФ=dd.MM.yyyy");
	
	ТекстПериодСценарий = СокрЛП(ОтчетОбъект.ПериодОтчета);
	Если ЗначениеЗаполнено(ОтчетОбъект.ИФО) Тогда
		ТекстПериодСценарий = ТекстПериодСценарий + ", ИФО: " + СокрЛП(ОтчетОбъект.ИФО);
	КонецЕсли;
	
	ТекстШапки = ТекстОтчет + СокрЛП(БюджетнаяОтчетностьПолучениеНСИ.ОфициальноеНаименование(ОтчетОбъект.Организация))+ ", "
		+ БюджетнаяОтчетность.ПредставлениеВидаОтчета(ОтчетОбъект.ВидОтчета)
		+ Символы.ПС+СокрЛП(ОтчетОбъект.ПериодОтчета);
		
	ОбластьШапкаОтчета.Параметры.ВидОтчета = БюджетнаяОтчетность.ПредставлениеВидаОтчета(ОтчетОбъект.ВидОтчета);
	ОбластьШапкаОтчета.Параметры.ТекстОтчет = ТекстОтчет;
	ОбластьШапкаОтчета.Параметры.ДатаФормирования = ТекущаяДатаСеанса();
	ОбластьШапкаОтчета.Параметры.Организация = СокрЛП(БюджетнаяОтчетностьПолучениеНСИ.ОфициальноеНаименование(ОтчетОбъект.Организация,Истина));
	ОбластьШапкаОтчета.Параметры.ПериодСценарий = ТекстПериодСценарий;
	ОбластьШапкаОтчета.Параметры.ОтчетСсылка = ОтчетОбъект.Ссылка;
	
	ОбластьШапкаОтчета.Параметры.КолОшибок = КоличественныеПараметры.КоличествоОшибок;
	ОбластьШапкаОтчета.Параметры.КолПредупреждений = КоличественныеПараметры.КоличествоПредупреждений;
	ОбластьШапкаОтчета.Параметры.КолОшибокРасчета = КоличественныеПараметры.КоличествоОшибокРасчета;
	
	Если КоличественныеПараметры.КоличествоОшибок = 0 Тогда
		ОбластьШапкаОтчета.Области.РезультатОшибки.ЦветТекста = ЦветОК;
	КонецЕсли;
	Если КоличественныеПараметры.КоличествоПредупреждений = 0 Тогда
		ОбластьШапкаОтчета.Области.РезультатПредупреждения.ЦветТекста = ЦветОК;
	КонецЕсли;
	Если КоличественныеПараметры.КоличествоОшибокРасчета = 0 Тогда 
		ОбластьШапкаОтчета.Области.РезультатОшибкиРасчета.ЦветТекста = ЦветОК;
	КонецЕсли;
			
	ТабДокШапка = Новый ТабличныйДокумент;
	
	ТабДокШапка.Вывести(ОбластьШапкаОтчета);
	
	Для Каждого СтрПараметр ИЗ ОтчетОбъект.мДополнительныеРеквизиты Цикл
		
		ВывестиОбластьРеквизита(СтрПараметр.Наименование,СтрПараметр.Значение,ОбластьРеквизиты,ТабДокШапка);
		
	КонецЦикла;
	
	ТабДокШапка.Вывести(ОбластьШапкаНижняяГраница);
	ТабДокШапка.Вывести(ТабДокумент);
		
	Возврат Новый Структура("ТабличныйДокумент,ДанныеРасшифровки",ТабДокШапка,ДанныеРасшифровки);
	
КонецФункции // ПолучитьТабличныйДокументПротоколаПроверки()

Процедура ВыводОбластиФЛК(макет, ОтчетОбъект, ТабДокумент, ТолькоОшибочные, СчетчикРасшифровок, ДанныеРасшифровки, РезультатПроверки, КоличественныеПараметры)
		
	ЦветОК 					= WebЦвета.ТемноЗеленый;
	ЦветОшибки  			= WebЦвета.Красный;
	ЦветПредупреждения  	= WebЦвета.Синий;
	ЦветФонаОК				= ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаОшибки 			= WebЦвета.ТусклоРозовый;
	ЦветФонаПредупреждения 	= WebЦвета.АкварельноСиний;
	ЦветАвто				= Новый Цвет();
	
	ЦветОшибкаРасчета 		= WebЦвета.Черный;
	ЦветФонаОшибкиРасчета	= WebЦвета.СеребристоСерый;
	
	ОбластьЗаголовокГруппы	= макет.ПолучитьОбласть("ГруппаСообщений");
	ОбластьСтрокаСообщения 	= Макет.ПолучитьОбласть("СтрокаСообщения");
	ОбластьОписание			= Макет.ПолучитьОбласть("ОписаниеСоотношения");
	ОбластьПредупреждение	= Макет.ПолучитьОбласть("ТекстПредупреждения");
	ОбластьШапкаКС			= Макет.ПолучитьОбласть("ШапкаСоотношения");
	ОбластьШапкаРазделитель	= Макет.ПолучитьОбласть("ШапкаРазделитель");
	
	ПараметрыОтбора = Новый Структура;
	Если ТолькоОшибочные Тогда
		МассивСтрокТаблицыКС = Новый Массив;
		
		Для Каждого СтрТЧ Из ОтчетОбъект.мКонтрольныеСоотношенияФЛК Цикл
			Если СтрТЧ.РезультатРасчета = Ложь
				ИЛИ СтрТЧ.РасчетВыполнен = Ложь Тогда
				МассивСтрокТаблицыКС.Добавить(СтрТЧ);
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаКонтрольныеСоотношения = ОтчетОбъект.мКонтрольныеСоотношенияФЛК.Скопировать(МассивСтрокТаблицыКС);
	Иначе
		ТаблицаКонтрольныеСоотношения = ОтчетОбъект.мКонтрольныеСоотношенияФЛК;
	КонецЕсли;
	
	ЕстьГруппировка = Ложь;
	
	Если ТаблицаКонтрольныеСоотношения.Количество() Тогда
		
		ОбластьЗаголовокГруппы.Параметры.НазваниеГруппы = "Проверка по форматно-логическому контролю";
		
		Если НЕ ТаблицаКонтрольныеСоотношения.Итог("РезультатРасчета") = ТаблицаКонтрольныеСоотношения.Количество() Тогда
			ОбластьЗаголовокГруппы.Области.РезультатРасчетаГруппа.ЦветФона	= ЦветФонаОшибки;
			ОбластьЗаголовокГруппы.Области.НазваниеГруппы.ЦветФона			= ЦветФонаОшибки;
		Иначе
			ОбластьЗаголовокГруппы.Области.РезультатРасчетаГруппа.ЦветФона	= ЦветФонаОК;
			ОбластьЗаголовокГруппы.Области.НазваниеГруппы.ЦветФона			= ЦветФонаОК;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьШапкаРазделитель);
		ТабДокумент.Вывести(ОбластьЗаголовокГруппы);
		
		ТабДокумент.НачатьГруппуСтрок("Проверка по форматно-логическому контролю",Истина);
		
		ЕстьГруппировка = Истина;
		
	КонецЕсли;
	
	ТаблицаКонтрольныеСоотношения.Сортировать("НомерСоотношения, КонтрольноеСоотношение");
	
	Для Каждого СтрСоотношение Из ТаблицаКонтрольныеСоотношения Цикл
		Если ТолькоОшибочные 
			И СтрСоотношение.РезультатРасчета
			И СтрСоотношение.РасчетВыполнен Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаРаскрытия = СтрСоотношение.ГруппаРаскрытия;
		// Вывод шапки
		ОбластьШапкаКС.Параметры.КонтрольноеСоотношение = СтрСоотношение.КонтрольноеСоотношение;
		
		Если СтрСоотношение.РасчетВыполнен = Ложь Тогда
			КоличественныеПараметры.Вставить("КоличествоОшибокРасчета", КоличественныеПараметры.КоличествоОшибокРасчета+1);
			
			ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "Ошибка расчета";
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветОшибкаРасчета;
			
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаОшибкиРасчета;
			ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаОшибкиРасчета;
		
		ИначеЕсли Не СтрСоотношение.РезультатРасчета И СтрСоотношение.Дополнительное <> Истина Тогда
			КоличественныеПараметры.Вставить("КоличествоОшибок", КоличественныеПараметры.КоличествоОшибок+1);
			
			РезультатПроверки = Ложь;
			ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "Ошибка";
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветОшибки;
			
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаОшибки;
			ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаОшибки;
		ИначеЕсли Не СтрСоотношение.РезультатРасчета И СтрСоотношение.Дополнительное = Истина Тогда
			КоличественныеПараметры.Вставить("КоличествоПредупреждений", КоличественныеПараметры.КоличествоПредупреждений+1);
			
			ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "Предупреждение";
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветПредупреждения;
			
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаПредупреждения;
			ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаПредупреждения;

		Иначе
			ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "ОК";
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветОК;
			
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаОК;
			ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаОК;
		КонецЕсли; 
		
		ТабДокумент.Вывести(ОбластьШапкаРазделитель);
		ТабДокумент.Вывести(ОбластьШапкаКС);
		
		//Группировка внутри одного соотношения:
		Если НЕ СтрСоотношение.РезультатРасчета Тогда 
			ТабДокумент.НачатьГруппуСтрок(,ТолькоОшибочные);
		КонецЕсли;
		
		// Вывод описания.
		Если Не ПустаяСтрока(СтрСоотношение.Описание) Тогда
			ОбластьОписание.Параметры.ОписаниеКонтрольногоСоотношения = СтрСоотношение.Описание;
			ТабДокумент.Вывести(ОбластьОписание);
		КонецЕсли;
		
		Если СтрСоотношение.РасчетВыполнен = Ложь Тогда
			ОбластьПредупреждение.Параметры.ТекстПредупрежденияКонтрольногоСоотношения = СтрСоотношение.ТекстОшибкиРасчета;
			ТабДокумент.Вывести(ОбластьПредупреждение);
			Продолжить;
		КонецЕсли;
		
		Если СтрСоотношение.Дополнительное = Истина
			И СтрСоотношение.РезультатРасчета = Ложь 
			И ЗначениеЗаполнено(СтрСоотношение.ТекстПояснения) Тогда
			
			ОбластьПредупреждение.Параметры.ТекстПредупрежденияКонтрольногоСоотношения = СтрСоотношение.ТекстПояснения;
			ТабДокумент.Вывести(ОбластьПредупреждение);
		КонецЕсли;
		
		Если СтрСоотношение.РезультатРасчета Тогда 
			Продолжить; //ошибки нет, строки не выводим
		КонецЕсли;
		
		Для Каждого СтрПроверки Из СтрСоотношение.СтрокиОтчета Цикл
			
			КодСтроки			= СтрПроверки.Ключ;
			ИтогПоСтроке 		= СтрПроверки.Значение.ИтогПоСтроке;
			НаименованиеСтроки 	= СтрПроверки.Значение.ФЛК_НаименованиеСтроки;
			ПоказателиПроверяемойСтроки = СтрПроверки.Значение.ТаблицаСтрок;
			
			Если ИтогПоСтроке Тогда
				ОбластьСтрокаСообщения.Параметры.ТекстСообщения = "	В группе строк """+КодСтроки+", "+НаименованиеСтроки+""" найдены строки, не соответствующие условию ФЛК:";
				ОбластьСтрокаСообщения.Область(1,1,1,9).ЦветФона = ЦветАвто;
				ТабДокумент.Вывести(ОбластьСтрокаСообщения);	
			КонецЕсли;
			
			
			Для Каждого стрСообщение Из ПоказателиПроверяемойСтроки Цикл
				
				Если НЕ стрСообщение.Ошибка Тогда
					Продолжить;
				КонецЕсли;
								
				ШаблонСтроки = "";
				Если ИтогПоСтроке Тогда  
					НомерТекСтроки = ПоказателиПроверяемойСтроки.Индекс(стрСообщение)+1;
					ШаблонСтроки = "		Строка: %1, по показателям: %3";
				Иначе
					НомерТекСтроки = КодСтроки;
					ШаблонСтроки = "В строке: %1 ""%2"" показатели не соответствуют условию ФЛК: %3";
				КонецЕсли;
				СтрокаПоказателей = стрСообщение.СообщениеПоФЛК;
				
				ОбластьСтрокаСообщения.Параметры.ТекстСообщения = СтрШаблон(ШаблонСтроки,НомерТекСтроки,НаименованиеСтроки,СокрП(СтрокаПоказателей)); 
				
				ОбластьСтрокаСообщения.Область(1,1,1,9).Объединить();
				ОбластьСтрокаСообщения.Область(1,1,1,9).ЦветФона = Новый Цвет(245, 245, 220);
				
				СтруктураРасшифровки = Новый Структура;
				
				СтруктураРасшифровки.Вставить("ДокументСсылка"  ,ОтчетОбъект.Ссылка);
				СтруктураРасшифровки.Вставить("РасшифровкаСтроки",Истина);
				СтруктураРасшифровки.Вставить("НомерСтроки"		,?(ИтогПоСтроке,Формат(НомерТекСтроки-1,"ЧН=0; ЧГ=0"),НомерТекСтроки));
				СтруктураРасшифровки.Вставить("КодСтроки"		,КодСтроки);
				СтруктураРасшифровки.Вставить("КонтрольноеСоотношение",СтрСоотношение.КонтрольноеСоотношение);
				СтруктураРасшифровки.Вставить("ИтогПоСтроке"	,ИтогПоСтроке);
				СтруктураРасшифровки.Вставить("ГруппаРаскрытия"	,ГруппаРаскрытия);
				
				ОбластьСтрокаСообщения.Параметры.РасшифровкаСтрокиСообщения = ДобавитьРасшифровкуУправляемыйРежим(ДанныеРасшифровки,
																													СтруктураРасшифровки,
																													СчетчикРасшифровок);
				 
				ТабДокумент.Вывести(ОбластьСтрокаСообщения);
			КонецЦикла;
		КонецЦикла;
		ТабДокумент.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
	Если ЕстьГруппировка Тогда
		ТабДокумент.ЗакончитьГруппуСтрок(); // окончить группу "ФЛК"
	КонецЕсли;

КонецПроцедуры

Процедура ВыводОбластиКонтрольБК(макет, ОтчетОбъект, ТабДокумент, ТолькоОшибочные, СчетчикРасшифровок, ДанныеРасшифровки, РезультатПроверки, КоличественныеПараметры)
		
	ЦветОК 					= WebЦвета.ТемноЗеленый;
	ЦветОшибки  			= WebЦвета.Красный;
	ЦветПредупреждения  	= WebЦвета.Синий;
	ЦветФонаОК				= ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаОшибки 			= WebЦвета.ТусклоРозовый;
	ЦветФонаПредупреждения 	= WebЦвета.АкварельноСиний;
	ЦветАвто				= Новый Цвет();
	
	ЦветОшибкаРасчета 		= WebЦвета.Черный;
	ЦветФонаОшибкиРасчета	= WebЦвета.СеребристоСерый;
	
	ОбластьЗаголовокГруппы	= макет.ПолучитьОбласть("ГруппаСообщений");
	ОбластьСтрокаСообщения 	= Макет.ПолучитьОбласть("СтрокаСообщения");
	ОбластьОписание			= Макет.ПолучитьОбласть("ОписаниеСоотношения");
	ОбластьПредупреждение	= Макет.ПолучитьОбласть("ТекстПредупреждения");
	ОбластьШапкаКС			= Макет.ПолучитьОбласть("ШапкаСоотношения");
	ОбластьШапкаРазделитель	= Макет.ПолучитьОбласть("ШапкаРазделитель");
	
	ПараметрыОтбора = Новый Структура;
		
	Если ТолькоОшибочные Тогда
		МассивСтрокТаблицыКС = Новый Массив;
		
		Для Каждого СтрТЧ Из ОтчетОбъект.мКонтрольныеСоотношенияБК Цикл
			Если СтрТЧ.РезультатРасчета = Ложь
				ИЛИ СтрТЧ.РасчетВыполнен = Ложь Тогда
				МассивСтрокТаблицыКС.Добавить(СтрТЧ);
			КонецЕсли;
		КонецЦикла;
	
		ТаблицаКонтрольныеСоотношения = ОтчетОбъект.мКонтрольныеСоотношенияБК.Скопировать(МассивСтрокТаблицыКС);
	Иначе
		ТаблицаКонтрольныеСоотношения = ОтчетОбъект.мКонтрольныеСоотношенияБК;
	КонецЕсли;
	
	ЕстьГруппировка = Ложь;
	
	Если ТаблицаКонтрольныеСоотношения.Количество() Тогда
		
		ОбластьЗаголовокГруппы.Параметры.НазваниеГруппы = "Проверка бюджетной классификации";
		
		Если НЕ ТаблицаКонтрольныеСоотношения.Итог("РезультатРасчета") = ТаблицаКонтрольныеСоотношения.Количество() Тогда
			ОбластьЗаголовокГруппы.Области.РезультатРасчетаГруппа.ЦветФона	= ЦветФонаОшибки;
			ОбластьЗаголовокГруппы.Области.НазваниеГруппы.ЦветФона			= ЦветФонаОшибки;
		Иначе
			ОбластьЗаголовокГруппы.Области.РезультатРасчетаГруппа.ЦветФона	= ЦветФонаОК;
			ОбластьЗаголовокГруппы.Области.НазваниеГруппы.ЦветФона			= ЦветФонаОК;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьШапкаРазделитель);
		ТабДокумент.Вывести(ОбластьЗаголовокГруппы);
		
		ТабДокумент.НачатьГруппуСтрок("Проверка бюджетной классификации",Истина);
		
		ЕстьГруппировка = Истина;
		
	КонецЕсли;
	
	ТаблицаКонтрольныеСоотношения.Сортировать("НомерСоотношения, КонтрольноеСоотношение");
	
	Для Каждого СтрСоотношение Из ТаблицаКонтрольныеСоотношения Цикл
		Если ТолькоОшибочные 
			И СтрСоотношение.РезультатРасчета
			И СтрСоотношение.РасчетВыполнен Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаРаскрытия = СтрСоотношение.ГруппаРаскрытия;
		// Вывод шапки
		ОбластьШапкаКС.Параметры.КонтрольноеСоотношение = СтрСоотношение.КонтрольноеСоотношение;
		
		Если СтрСоотношение.РасчетВыполнен = Ложь Тогда
			КоличественныеПараметры.Вставить("КоличествоОшибокРасчета", КоличественныеПараметры.КоличествоОшибокРасчета+1);
			
			ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "Ошибка расчета";
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветОшибкаРасчета;
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаОшибкиРасчета;
			ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаОшибкиРасчета;
		
		ИначеЕсли Не СтрСоотношение.РезультатРасчета И СтрСоотношение.Дополнительное <> Истина Тогда
			КоличественныеПараметры.Вставить("КоличествоОшибок", КоличественныеПараметры.КоличествоОшибок+1);
			
			РезультатПроверки = Ложь;
			ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "Ошибка";
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветОшибки;
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаОшибки;
			ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаОшибки;
			
		ИначеЕсли Не СтрСоотношение.РезультатРасчета И СтрСоотношение.Дополнительное = Истина Тогда
			КоличественныеПараметры.Вставить("КоличествоПредупреждений", КоличественныеПараметры.КоличествоПредупреждений+1);
			
			ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "Предупреждение";
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветПредупреждения;
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаПредупреждения;
			ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаПредупреждения;

		Иначе
			ОбластьШапкаКС.Параметры.РезультатРасчета 	 = "ОК";
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветТекста = ЦветОК;
			ОбластьШапкаКС.Области.РезультатРасчета.ЦветФона = ЦветФонаОК;
			ОбластьШапкаКС.Области.КС.ЦветФона = ЦветФонаОК;
			
		КонецЕсли; 
		
		ТабДокумент.Вывести(ОбластьШапкаРазделитель);
		ТабДокумент.Вывести(ОбластьШапкаКС);
		
		//Группировка внутри одного соотношения:
		Если НЕ СтрСоотношение.РезультатРасчета Тогда 
			ТабДокумент.НачатьГруппуСтрок(,ТолькоОшибочные);
		КонецЕсли;
		
		// Вывод описания.
		Если Не ПустаяСтрока(СтрСоотношение.Описание) Тогда
			ОбластьОписание.Параметры.ОписаниеКонтрольногоСоотношения = СтрСоотношение.Описание;
			ТабДокумент.Вывести(ОбластьОписание);
		КонецЕсли;
		
		Если СтрСоотношение.РасчетВыполнен = Ложь Тогда
			ОбластьПредупреждение.Параметры.ТекстПредупрежденияКонтрольногоСоотношения = СтрСоотношение.ТекстОшибкиРасчета;
			ТабДокумент.Вывести(ОбластьПредупреждение);
			Продолжить;
		КонецЕсли;
		
		
		Если СтрСоотношение.Дополнительное = Истина
			И СтрСоотношение.РезультатРасчета = Ложь 
			И ЗначениеЗаполнено(СтрСоотношение.ТекстПояснения) Тогда
			
			ОбластьПредупреждение.Параметры.ТекстПредупрежденияКонтрольногоСоотношения = СтрСоотношение.ТекстПояснения;
			ТабДокумент.Вывести(ОбластьПредупреждение);
		КонецЕсли;
		
		Если СтрСоотношение.РезультатРасчета Тогда 
			Продолжить;//ошибки нет, строки не выводим
		КонецЕсли;
		
		Для Каждого СтрПроверки Из СтрСоотношение.СтрокиОтчета Цикл
			
			КодСтроки			= СтрПроверки.Ключ;
			ИтогПоСтроке 		= СтрПроверки.Значение.ИтогПоСтроке;
			НаименованиеСтроки 	= СтрПроверки.Значение.БК_НаименованиеСтроки;
			ПоказателиПроверяемойСтроки = СтрПроверки.Значение.ТаблицаСтрок;
			
			Если ИтогПоСтроке Тогда
				ОбластьСтрокаСообщения.Параметры.ТекстСообщения = "	В группе строк """+КодСтроки+", "+НаименованиеСтроки+""" найдены строки, не прошедшие контроль БК:";
				ОбластьСтрокаСообщения.Область(1,1,1,9).ЦветФона = ЦветАвто;
				ТабДокумент.Вывести(ОбластьСтрокаСообщения);	
			КонецЕсли;
			
			
			Для Каждого стрСообщение Из ПоказателиПроверяемойСтроки Цикл
				
				Если НЕ стрСообщение.Ошибка Тогда
					Продолжить;
				КонецЕсли;
								
				ШаблонСтроки = "";
				Если ИтогПоСтроке Тогда  
					НомерТекСтроки = ПоказателиПроверяемойСтроки.Индекс(стрСообщение)+1;
					ШаблонСтроки = "		Строка %1: %3";
				Иначе
					НомерТекСтроки = КодСтроки;
					ШаблонСтроки = "В строке: %1 ""%2"" показатели не соответствуют условию ФЛК: %3";
				КонецЕсли;
				СтрокаПоказателей = стрСообщение.СообщениеПоКС;
				
				ОбластьСтрокаСообщения.Параметры.ТекстСообщения = СтрШаблон(ШаблонСтроки,НомерТекСтроки,НаименованиеСтроки,СокрП(СтрокаПоказателей)); 
				
				ОбластьСтрокаСообщения.Область(1,1,1,9).Объединить();
				ОбластьСтрокаСообщения.Область(1,1,1,9).ЦветФона = Новый Цвет(245, 245, 220);
				
				СтруктураРасшифровки = Новый Структура;
				
				СтруктураРасшифровки.Вставить("ДокументСсылка"  ,ОтчетОбъект.Ссылка);
				СтруктураРасшифровки.Вставить("РасшифровкаСтроки",Истина);
				СтруктураРасшифровки.Вставить("НомерСтроки"		,?(ИтогПоСтроке,Формат(НомерТекСтроки-1,"ЧН=0; ЧГ=0"),НомерТекСтроки));
				СтруктураРасшифровки.Вставить("КодСтроки"		,КодСтроки);
				СтруктураРасшифровки.Вставить("КонтрольноеСоотношение",СтрСоотношение.КонтрольноеСоотношение);
				СтруктураРасшифровки.Вставить("ИтогПоСтроке"	,ИтогПоСтроке);
				СтруктураРасшифровки.Вставить("ГруппаРаскрытия"	,ГруппаРаскрытия);
				
				ОбластьСтрокаСообщения.Параметры.РасшифровкаСтрокиСообщения = ДобавитьРасшифровкуУправляемыйРежим(ДанныеРасшифровки,
																													СтруктураРасшифровки,
																													СчетчикРасшифровок);
				 
				ТабДокумент.Вывести(ОбластьСтрокаСообщения);
			КонецЦикла;
		КонецЦикла;
		ТабДокумент.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
	Если ЕстьГруппировка Тогда
		ТабДокумент.ЗакончитьГруппуСтрок(); // окончить группу "ФЛК"
	КонецЕсли;

КонецПроцедуры

// Настраивает построитель для отбора отчетов.
//
Процедура Инициализация() Экспорт

	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ
	|	УниверсальныйРегламентированныйОтчет.Ссылка
	|ИЗ
	|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
	|ГДЕ
	|	УниверсальныйРегламентированныйОтчет.ПометкаУдаления = Ложь
	|{ГДЕ
	|	УниверсальныйРегламентированныйОтчет.Организация.* КАК Учреждение,
	|	УниверсальныйРегламентированныйОтчет.ВидОтчета.* КАК ВидОтчета,
	|	УниверсальныйРегламентированныйОтчет.ПериодОтчета.* КАК ПериодОтчета,
	|	УниверсальныйРегламентированныйОтчет.Ссылка.* КАК ЭкземплярОтчета}";
	
	мКэшДанныхОтобранныхОтчетов = ПолучитьТаблицуГруппировкиПротоколов();
	
	мКэшДанныхОтобранныхОтчетов.Колонки.Добавить("ОперандыСоотношений");
	
	мКэшДанныхОтобранныхОтчетов.Индексы.Добавить("Ссылка");
	мКэшДанныхОтобранныхОтчетов.Индексы.Добавить("Организация");

КонецПроцедуры

// Выдает протокол в виде табличного документа, если выполняется на клиенте и
// в виде текстового документа html, если выполняется не на клиенте.
//
Функция ПолучитьПротоколПроверки(ОтчетОбъект,ТолькоОшибочные = Истина, СчетчикРасшифровок = 0) Экспорт

	Возврат ПолучитьТабличныйДокументПротоколаПроверки(ОтчетОбъект,ТолькоОшибочные, СчетчикРасшифровок);
		
КонецФункции

// Выполняет поиск в таблице значений мКэшДанныхОтобранныхОтчетов.
//
Функция ПолучитьДанныеИзКэша(ДокументСсылка) Экспорт
	
	Возврат мКэшДанныхОтобранныхОтчетов.Найти(ДокументСсылка,"Ссылка");
	
КонецФункции // ПолучитьДанныеИзКэша()

// Выполняет проверку списка отчетов и формирует протоколы
//
//
Процедура ПроверитьОтчеты(ФормироватьПротоколы,ФормаПрогресса = Неопределено) Экспорт

	Инициализация();

	Если ИспользоватьВнешнийСписокОтчетов() Тогда
		СписокОтчетов = мСписокПроверяемыхДокументов;		
	Иначе
		ПостроительЗапроса.Выполнить();
		СписокОтчетов = ПостроительЗапроса.Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	ЭтоСписокЗначений = ТипЗнч(СписокОтчетов) = Тип("СписокЗначений");
	
	#Если Клиент Тогда
		Если Не ФормаПрогресса = Неопределено и ФормаПрогресса.МаксимальноеЗначение = 0 Тогда
			ФормаПрогресса.МаксимальноеЗначение = СписокОтчетов.Количество();
		КонецЕсли;
	#КонецЕсли
	
	Для Каждого ЭлементСписка Из СписокОтчетов Цикл
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		
		Если ЭтоСписокЗначений Тогда
			Объект = ЭлементСписка.Значение.ПолучитьОбъект();
		Иначе
			Объект = ЭлементСписка.ПолучитьОбъект();
		КонецЕсли;
		
		#Если Клиент Тогда
			Если Не ФормаПрогресса = Неопределено Тогда
				ФормаПрогресса.КомментарийЗначения = Строка(Объект.Ссылка);
				ФормаПрогресса.Значение			   = ФормаПрогресса.Значение + 1;
			КонецЕсли;
		#КонецЕсли
		
		// Стандартная проверка вкючает в себя контроль как КС, так и произвольного кода.
		РезультатПроверки = Объект.ПолучитьРезультатПроверки(, Не ФормироватьПротоколы);
		
		Если РезультатПроверки.БезОшибок = Ложь Тогда
			ТекстСообщения = Нстр("ru='Проверка КС не пройдена! Организационная единица: %1; период: %2; вид отчета: %3.'");	
		ИначеЕсли РезультатПроверки.БезПредупреждений = Ложь Тогда	
			ТекстСообщения = Нстр("ru='При проверке КС есть предупреждения! Организационная единица: %1; период: %2; вид отчета: %3.'");
		Иначе
			ТекстСообщения = Нстр("ru='Проверка пройдена. Организационная единица: %1; период: %2; вид отчета: %3.'");
		КонецЕсли;
		
		Если РезультатПроверки.БезОшибок 
			И РезультатПроверки.БезПредупреждений 
			И Не ФормироватьПротоколы Тогда
			Сообщить("Проверка пройдена. Организационная единица: " + Объект.Организация + "; период: " + Объект.ПериодОтчета + "; вид отчета: " + Объект.ВидОтчета + ".", СтатусСообщения.Информация);
		КонецЕсли;
		
		Если ПолучитьДанныеИзКэша(Объект.Ссылка) = Неопределено Тогда
			СтрокаКэша = мКэшДанныхОтобранныхОтчетов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКэша,Объект);
			СтрокаКэша.Ссылка 		  = Объект.Ссылка;
			СтрокаКэша.ОтчетныйПериод = Объект.ПериодОтчета;
			СтрокаКэша.ОперандыСоотношений = Объект.мОперандыКонтр.Скопировать();
			СтрокаКэша.ВсегоОшибок = РезультатПроверки.ВФОшибки + РезультатПроверки.МФОшибки;
			СтрокаКэша.ВсегоПредупреждений = РезультатПроверки.ВФПредупреждения + РезультатПроверки.МФПредупреждения;
		КонецЕсли;
		
		Если ФормироватьПротоколы Тогда
			
			Протокол = ПолучитьТабличныйДокументПротоколаПроверки(Объект,Не ВыводитьВсеСоотношения);
			
			СтрокаКэша.ПротоколПроверки = Протокол;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьПротоколыПроверки()

// Выводит отчет в табличный документ.
//
Процедура СформироватьОтчет(ТабДок,ОтображатьПротоколы = Истина,ФормаПрогресса = Неопределено) Экспорт
	
	Если ОтображатьПротоколы Тогда
		ТабДок.Очистить();
	КонецЕсли;
	
	ПроверитьОтчеты(ОтображатьПротоколы,ФормаПрогресса);
	
	Для Каждого СтрПротокол Из мКэшДанныхОтобранныхОтчетов Цикл
		ПротоколПроверки = Неопределено;
		Расшифровка = Неопределено;
		
		Если ОтображатьПротоколы Тогда
			ПротоколПроверки  = СтрПротокол.ПротоколПроверки.ТабличныйДокумент;
			ДанныеРасшифровки = СтрПротокол.ПротоколПроверки.ДанныеРасшифровки;
		КонецЕсли;
		
		Если ПротоколПроверки <> Неопределено Тогда
			ОбластьОтчета = ТабДок.Вывести(ПротоколПроверки);
			НачалоГруппировки = ОбластьОтчета.Верх+ПротоколПроверки.Области.ШапкаНижняяГраница.Верх;
			Если ОбластьОтчета.Низ >= НачалоГруппировки Тогда
				ОбластьГруппировки = ТабДок.Область(НачалоГруппировки,,ОбластьОтчета.Низ);
				ОбластьГруппировки.Сгруппировать(,РасположениеЗаголовкаГруппировкиТабличногоДокумента.Начало);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // СформироватьОтчет()

#КонецЕсли
